Revit 2026 API
NavisworksExportOptions Methods
The NavisworksExportOptions type exposes the following members.
Methods
Name | Description
Dispose
Equals | Determines whether the specified object is equal to the current object.
(Inherited from Object)
GetHashCode | Serves as the default hash function.
(Inherited from Object)
GetSelectedElementIds |  Returns the element ids of the elements to export. Empty by default.
GetType | Gets the Type of the current instance.
(Inherited from Object)
SetSelectedElementIds
ToString | Returns a string that represents the current object.
(Inherited from Object)
Top
See Also
Reference
NavisworksExportOptions Class
Autodesk.Revit.DB Namespace